# **Lecture 16: Working with JSON Format and SQL Database in Machine Learning**

#  Why is This Important in Machine Learning?


---


Data comes from many sources: APIs, files, databases.


JSON is the most common format for APIs and web data.


SQL databases are common for large storage (millions of rows).


If you want real-world ML projects, you must know how to read and write data from these

# **Part 1: Working with JSON Format**

#  What is JSON?

JSON = JavaScript Object Notation

It is a text format to store data like Python dictionaries.

In [73]:
# Example of JSON:

# {
#   "name": "Alice",
#   "age": 25,
#   "skills": ["Python", "Machine Learning", "SQL"]
# }
# 👉 It looks like a Python dictionary but in text format.

#  How to Work with JSON in Python?

👉 Python has a built-in library called json.

In [74]:
#  Code: Loading JSON (Reading JSON file)

import pandas as pd
pd.read_json('train.json')

          id      cuisine                                        ingredients
0      10259        greek  [romaine lettuce, black olives, grape tomatoes...
1      25693  southern_us  [plain flour, ground pepper, salt, tomatoes, g...
2      20130     filipino  [eggs, pepper, salt, mayonaise, cooking oil, g...
3      22213       indian                [water, vegetable oil, wheat, salt]
4      13162       indian  [black pepper, shallots, cornflour, cayenne pe...
...      ...          ...                                                ...
39769  29109        irish  [light brown sugar, granulated sugar, butter, ...
39770  11462      italian  [KRAFT Zesty Italian Dressing, purple onion, b...
39771   2238        irish  [eggs, citrus fruit, raisins, sourdough starte...
39772  41882      chinese  [boneless chicken skinless thigh, minced garli...
39773   2362      mexican  [green chile, jalapeno chilies, onions, ground...

[39774 rows x 3 columns]

In [75]:
pd.read_json("https://api.exchangerate-api.com/v4/latest/USD")

,provider,WARNING_UPGRADE_TO_V6,terms,base,date,time_last_updated,rates
USD,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2025-06-11,1749600001,1.00
AED,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2025-06-11,1749600001,3.67
AFN,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2025-06-11,1749600001,69.79
ALL,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2025-06-11,1749600001,85.93
AMD,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2025-06-11,1749600001,383.53
...,...,...,...,...,...,...,...
XPF,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2025-06-11,1749600001,104.42
YER,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2025-06-11,1749600001,243.17
ZAR,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2025-06-11,1749600001,17.71
ZMW,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2025-06-11,1749600001,25.16
ZWL,https://www.exchangerate-api.com,https://www.exchangerate-api.com/docs/free,https://www.exchangerate-api.com/terms,USD,2025-06-11,1749600001,26.96

# Code: Saving Data to JSON File (Writing JSON file)

In [76]:
import json

In [77]:
# Python dictionary
student = {
    "name": "Bob",
    "age": 22,
    "skills": ["Data Science", "Deep Learning"]
}

# Save to JSON file
with open('student.json', 'w') as file:
    json.dump(student, file, indent=4)

print("Saved successfully!")

Saved successfully!

In [78]:
import json

# Let's say you have a JSON file called 'student.json'

# 1. Open the file
with open('student.json', 'r') as file:
    data = json.load(file)

# 2. Now 'data' is a Python dictionary
print(data)
print(data['name'])  # Output: Alice

{'name': 'Bob', 'age': 22, 'skills': ['Data Science', 'Deep Learning']}
Bob

# Real Life Example:

When you call a weather API, you receive data in JSON format.


You load it, extract features, and train a model.

# **Part 2: Working with SQL Database**

# **What is SQL?**

SQL = Structured Query Language.


It is used to store, retrieve, and manage large amounts of data.


Most companies store user data, sales data, etc., in SQL databases.

# **How to Work with SQL in Python?**


---


## 👉 Python library:

 sqlite3 (for small, local databases).

👉 Bigger real-world databases use MySQL, PostgreSQL, but basics are same

In [ ]:
# First, make sure you have the mysql.connector library installed
# If you ran this before, you might not need to run it again, but it's good practice to include.
# !pip install mysql.connector

Requirement already satisfied: mysql.connector in c:\users\hp\anaconda3\envs\streamlit\lib\site-packages (2.2.9)

[notice] A new release of pip is available: 25.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [80]:
# Import the necessary library
import mysql.connector
import pandas as pd # use pandas to read data into dataframes

# --- IMPORTANT PREREQUISITE ---
# Make sure the MySQL module in your XAMPP Control Panel is RUNNING
# If it's stopped, you will get a "Connection refused" error.
# Open XAMPP Control Panel -> Start the 'MySQL' module.
# ------------------------------

In [81]:
# Define the connection parameters for XAMPP MySQL
# Default settings for XAMPP on localhost:
db_config = {
    "host": "localhost",
    "user": "root",
    "password": "",  # Default XAMPP root usually has no password
    "database": "titanic" # Replace with the name of your database in XAMPP
}

In [82]:


# Attempt to connect to the MySQL database
conn = None # Initialize conn to None
try:
    print(f"Attempting to connect to database '{db_config['database']}' on '{db_config['host']}'...")
    conn = mysql.connector.connect(**db_config) # Use the dictionary for connection parameters
    print("Successfully connected to the XAMPP MySQL database!")




except mysql.connector.Error as err:
    # This block will catch connection errors (like "Connection refused")
    print(f"\nError: {err}")
    print("\nCould not connect to the database. Please ensure:")
    print("1. The MySQL module in your XAMPP Control Panel is RUNNING.")
    print("2. The database name ('titanic') exists in your XAMPP MySQL.")
    print("3. The host ('localhost'), user ('root'), and password (empty string) are correct.")
    print("4. No firewall is blocking the connection on port 3306.")
except Exception as e:
    # Catch any other unexpected errors
    print(f"\nAn unexpected error occurred: {e}")

finally:
    # It's good practice to close the connection when done
    if conn is not None and conn.is_connected():
        conn.close()
        print("\nDatabase connection closed.")
    elif conn is not None:
         # This case is unlikely if connect() succeeded but close() is called
         pass # Connection was likely not fully established or already closed
    else:
         print("\nConnection was not established, nothing to close.")

Attempting to connect to database 'titanic' on 'localhost'...
Successfully connected to the XAMPP MySQL database!

Database connection closed.

In [83]:
# --- Now you can interact with your database ---

    # Example: Fetching data using pandas (requires pandas imported)
    # Ensure the table 'city' exists in your 'titanic' database
try:
        
        df = pd.read_sql_query("SELECT * FROM train", conn)
        print("\nData from 'city' table:")
        display(df.head()) # Use display() in Jupyter/Colab for better output
except pd.io.sql.DatabaseError as db_err:
        print(f"\nError executing SQL query: {db_err}")
        print("Please ensure the table 'train' exists in your 'titanic' database.")
except Exception as e:
         print(f"\nAn unexpected error occurred during query execution: {e}")

An unexpected error occurred during query execution: MySQL Connection not available.

C:\Users\hp\AppData\Local\Temp\ipykernel_8508\3090390379.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("SELECT * FROM train", conn)

In [84]:
conn = mysql.connector.connect(host="localhost",user="root",password="",database='titanic')

In [85]:
pd.read_sql_query("SELECT * FROM train",conn)

C:\Users\hp\AppData\Local\Temp\ipykernel_8508\485272551.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT * FROM train",conn)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13.0000,,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,,1,2,W./C. 6607,23.4500,,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,7.7500,,Q

In [86]:


# Create or connect to a database file
conn = mysql.connector.connect(host="localhost",user="root",password="",database='testdb')

# Create a cursor to execute commands
cursor = conn.cursor()

print("Database connected!")

Database connected!

In [87]:
# ✍️ Code: Creating a Table


# Create a table for  new students
cursor.execute('''
    CREATE TABLE IF NOT EXISTS new_students (
        id INT AUTO_INCREMENT PRIMARY KEY,
        name VARCHAR(255),
        age INT,
        course VARCHAR(255)
    )
    ''')
conn.commit()
print("Table created or already exists.")

Table created or already exists.

In [88]:
 # ✍️ Code: Inserting Data

    # Insert a new student
cursor.execute('''
        INSERT INTO new_students (name, age, course)
        VALUES (%s, %s, %s)
    ''', ("asad", 28, "software engineer"))

conn.commit()
print("Data inserted successfully!")

Data inserted successfully!

In [95]:
#✍️ Code: Fetching Data


# Fetch all records
cursor.execute('SELECT * FROM new_students')
rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Bob', 22, 'Machine Learning Engineer')
(2, 'ali', 24, 'Deep learning')
(3, 'amir', 26, 'Data Engineer')

In [90]:
#✍️ Code: Updating and Deleting Data


# Update student's course
cursor.execute('''
        UPDATE new_students
        SET course = %s
        WHERE name = %s
    ''', ("Machine Learning Engineer", "Bob"))  # Use %s for parameterized query

conn.commit()
print("Data updated successfully!")

Data updated successfully!

In [91]:
for row in rows:
    print(row)

(1, 'Bob', 22, 'Machine Learning Engineer')
(2, 'ali', 24, 'Deep learning')
(3, 'amir', 26, 'Data Engineer')
(5, 'asad', 28, 'software engineer')

In [94]:
# Delete a student
cursor.execute('''
        DELETE FROM new_students
        WHERE name = %s
    ''', ("asad",))  # Use %s for parameterized query

conn.commit()
print("Data deleted successfully!")

Data deleted successfully!

In [96]:
for row in rows:
    print(row)

(1, 'Bob', 22, 'Machine Learning Engineer')
(2, 'ali', 24, 'Deep learning')
(3, 'amir', 26, 'Data Engineer')

# **Real Life Example:**

E-commerce apps store products and customer information in a SQL database.


In ML projects, you pull the customer data → predict customer churn → suggest offers.